/*
* Finder
*
* https://github.com/walkerchiu/jQuery-finder
*
*/

(function(factory){
    if (typeof define === 'function' && define.amd) {   /* RequireJS */
        define(['jquery'], factory);
    } else if (typeof exports === 'object') {           /* Backbone.js */
        factory(require('jquery'));
    } else {                                            /* Jquery plugin */
        factory(jQuery);
    }
}(function($){
    'use strict';

    var obj, settings, distance;
    var gametimer, counter, duration;
    var showTag = 0;
    var showPic = 0;
    let scores = {
        reset: function () {
            this.step_total = 0;
            this.step_now = 0;
            this.success = 0;
            this.fail = 0;
        }
    };
    let DefaultSettings = {
        'outerWidth': $(window).outerWidth(),
        'outerHeight': $(window).outerHeight(),
        'width': 5,
        'height': 5,
        'distance': 100,
        'entropy': 200,
        'task': 'color',
        'duration': 60,
        'len': 1,
        'minkinds': 2,
        'maxkinds': 5
    };

    const Timer = function Timer(fn, t) {
        var timerObj = setInterval(fn, t);
        this.stop = function () {
            if (timerObj) {
                clearInterval(timerObj);
                timerObj = null;
            }
            return this;
        }
        this.start = function () {
            if (!timerObj) {
                this.stop();
                timerObj = setInterval(fn, t);
            }
            return this;
        }
        this.adjust = function (newT) {
            t = newT;
            return this.stop().start();
        }
        this.reset = function (d) {
            duration = d;
            return this.stop().start();
        }
    }
    const isEqual = function (value, other) {
        for (var i = 0; i < value.length; i++)
            if ((value[i] !== other[i])) return false;
        return true;
    };
    const delay = function (s) {
        return new Promise( function (resolve,reject) {
            setTimeout(resolve,s); 
        });
    };
    const countFrequency = (array, value) => array.reduce((a, v) => v === value ? a+1 : a+0, 0);

    function countDown(type, timer) {
        let minutes, seconds, result;
        duration = settings.duration;

        function formater() {
            minutes = parseInt(duration / 60, 10)
            seconds = parseInt(duration % 60, 10);

            minutes = minutes < 10 ? "0" + minutes : minutes;
            seconds = seconds < 10 ? "0" + seconds : seconds;
            result = minutes + ":" + seconds;

            timer.html(result);

            if (result == "00:00") { counter.stop(); GameOver(); }
            duration = (--duration < 0) ? timer : duration;
        }
        formater();

        if (type) counter = new Timer(formater, 1000);
        else      counter.reset(duration);
    }
    function makeSimpleQuestion(size, task, len, mink, maxk) {
        function makeOption(candidates, len) {
            let option = '';
            for (let i=0; i<len; i++) {
                let r = Math.floor((Math.random() * candidates.length));
                option += candidates[r];
            }
            return option;
        }

        let bags = items[task];
        if (typeof bags[0][0] === 'string')
            bags = Object.values(items[task]);
        for (let i = bags.length-1; i--;)
            if (bags[i].length < mink) bags.splice(i, 1);

        let ques = [];
        let trap = [];
        let flag = 0;
        let r = Math.floor(Math.random() * bags.length);
        while (1) {
            let option = makeOption(bags[r], len);
            ques.push(option);

            if (ques.length == 1) continue;
            if (isEqual(ques[0], option)) ques.pop();
            else if (!trap.includes(option)) trap.push(option);
            if (trap.length == maxk-1) {
                while (ques.length <= size) {
                    ques.push(option);
                    flag = 1;
                }
            }
            if (ques.length > size || flag) break;
        }
        $.each(trap, function (index, value) {
            if (countFrequency(ques, value) == 1) {
                $.each(trap, function (index2, value2) {
                    if (countFrequency(ques, value2) > 2)
                        ques[ques.indexOf(value2)] = ques[ques.indexOf(value)];
                });
            }
        });
        return [ques, trap];
    }
    function makeRelatedQuestion(size) {
        let ques = [];
        let bag  = items.rel;
        let r    = Math.floor(Math.random() * (bag.length-1)+1);

        let r2 = Math.floor(Math.random() * bag[r][0].length);
        ques.push(bag[r][0][r2]);

        while (1) {
            let r3 = Math.floor(Math.random() * bag[r][1].length);
            let value = bag[r][1][r3];
            if (!ques.includes(value))
                ques.push(value);
            if (ques.length == bag[r][1].length || ques.length == size) break;
        }
        while (ques.length <= size) ques.push('');

        return [ques, []];
    }
    function initContainer() {
        distance = settings.distance;
        do {
            if (distance*settings.width < settings.outerWidth && distance*settings.height < settings.outerHeight)
                break;
            else
                distance--;
        } while(1);

        let size = settings.width * settings.height;
        if (['pic','color','rel'].includes(settings.task)) settings.len = 1;
        if (settings.minkinds < 2) settings.minkinds = 2;
        if (settings.maxkinds*2 > size-1) settings.maxkinds = 2;
        if (settings.maxkinds < settings.minkinds) settings.minkinds = settings.maxkinds;
    }
    function initShow() {
        obj.find(".game-wrap").empty().css("width", settings.width * distance).css("height", settings.height * distance);
        obj.find(".game-step-total").html(scores.step_total);
        obj.find(".game-step-now").html(scores.step_now);
        obj.find(".game-score-success").html(scores.success);
        obj.find(".game-score-fail").html(scores.fail);

        let size = settings.width * settings.height;
        let [question, trap] = (settings.task == 'rel') ? makeRelatedQuestion(size)
                                                        : makeSimpleQuestion(size, settings.task, settings.len, settings.minkinds, settings.maxkinds);

        let li;
        let i = 0;
        let map = [], mapi = [];
        for (let y=0; y<settings.height; y++) {
            for (let x=0; x<settings.width;) {
                let r = Math.floor(Math.random() * size)+1;
                if (!mapi.includes(r)) {
                    li = $("<li>", {'class': "item", 'data-id': i, 'data-pos': x+'_'+y}).append($("<span>", {'class': "item-tag", 'text': i+1}));
                    if (settings.task == 'pic') {
                        li.append($("<div>", {'class': "item-data"}).css('background', "transparent url('"+question[r]+"')").css('background-repeat', 'no-repeat').css('background-size', 'cover'));
                    } else if (settings.task == 'color') {
                        li.append($("<div>", {'class': "item-data"}).css('background', question[r]));
                    } else {
                        li.append($("<div>", {'class': "item-data", 'text': question[r]}));
                    }
                    obj.find(".game-wrap").append(li);
                    map.push(question[r]);
                    mapi.push(r);
                    x++;
                    i++;
                }
            }
        }
        obj.find("li").css("width", distance).css("height", distance);
        obj.find(".item-data").css("width", distance).css("height", distance).css("line-height", distance + 'px');

        if (settings.task == 'rel') {
            if (obj.find(".item-data:empty").length > 0)
                r = obj.find(".item-data:empty").eq(0).parent().data("id");
            else
                r = Math.floor(Math.random() * map.length);
        } else {
            let tmp = [];
            $.each(trap, function (index, value) {
                if (countFrequency(map, value) > 2) tmp.push(value);
            });
            console.log(map);
            console.log(tmp);
            var r;
            while (1) {
                r = Math.floor(Math.random() * map.length);
                if (tmp.includes(map[r])) break;
            }
            console.log(r);
            console.log(question[0]);
        }
        map[r] = question[0];
        li = obj.find("li[data-id='"+(r)+"']");
        if (li == undefined) console.log("li undefined");
        li.addClass("item-target");
        if (settings.task == 'pic')   li.find(".item-data").css('background', "transparent url('"+question[0]+"')").css('background-repeat', 'no-repeat').css('background-size', 'cover');
        else if (settings.task == 'color') li.find(".item-data").css('background', question[0]);
        else                          li.find(".item-data").html(question[0]);
        if (showTag) obj.find(".item-tag").show();
        if (showPic) obj.find(".item-data").removeClass("hidden");
        if (settings.task == 'rel')
            obj.find(".item-data:empty").parent().css("cursor", "default");
        counter.start();
    }
    function check(li) {
        function clear() {
            counter.stop();
            delay(300).then( function () {
                let title = $("<div>", {'class': "lead", 'text': "Success!"}).css("line-height", distance*settings.height + 'px');
                obj.find(".game-wrap").html($("<li>", {'class': "game-success"}).append(title)
                                                      .css("width", distance*settings.width).css("height", distance*settings.height));
                return delay(300);
            }).then( function () {
                initShow();
            });
        }
        if (settings.task == 'rel' && li.find(".item-data").text() == '') return;
        obj.find(".game-step-total").html(++scores.step_total);
        if (li.hasClass("item-target")) {
            obj.find(".game-score-success").html(++scores.success);
            scores.step_now = 0;
            obj.find(".game-step-now").html(scores.step_now);
            li.find(".item-data").fadeOut(100).fadeIn(100);
            clear();
        } else {
            obj.find(".game-score-fail").html(++scores.fail);
            scores.step_now++;
            obj.find(".game-step-now").html(scores.step_now);
            li.find(".item-data").fadeOut(100).fadeIn(100);
        }
    }
    function GameOver() {
        let title = $("<div>", {'class': "lead", 'text': "~ Game Over ~"});
        let success = $("<p>").html("Success: "+scores.success);
        let fail  = $("<p>").html("Fail: "+scores.fail);
        let ratio = (scores.step_total == 0) ? "&infin;" : Math.round(scores.success*100 / scores.step_total) + "%";
            ratio = $("<p>").html("Success Rate: "+ratio);
        let li = $("<li>", {'class': "game-over"}).append(title).append(success).append(fail).append(ratio)
                                                  .css("width", distance*settings.width+1)
                                                  .css("height", distance*settings.height+1);
        obj.find(".game-wrap").prepend(li).children("li.game-over").fadeIn();
    }

    $.fn.Finder_init = function (options) {
        settings = $.extend(DefaultSettings, options);
        gametimer = $(this).find(".game-timer");
        obj = $(this);
        scores.reset();

        obj.find(".game-option .game-width").val(settings.width);
        obj.find(".game-option .game-height").val(settings.height);
        obj.find(".game-option .game-duration").val(settings.duration);
        obj.find(".game-option .game-len").val(settings.len);
        obj.find(".game-option .game-minkinds").val(settings.minkinds);
        obj.find(".game-option .game-maxkinds").val(settings.maxkinds);

        initContainer();
        countDown(1, gametimer);
        initShow();

        $(this).on("click", ".item", function () {
            check($(this));
        });
        $(this).on("change", ".game-minkinds", function () {
            let value = $(this).val();
            obj.find(".game-maxkinds option").show();
            obj.find(".game-maxkinds option").filter( function () { return $(this).val() < value; }).hide();
        });
        $(this).on("click", ".option-btn", function () {
            obj.find(".game-option").slideToggle();
            obj.find(".restart-btn").toggle(); $(this).toggle();
        });
        $(this).on("click", ".switchTag", function () {
            obj.find(".item-tag").toggle();
            showTag = !showTag;
        });
        $(this).on("click", ".switchPic", function () {
            obj.find(".item-data").toggleClass("hidden");
            showPic = !showPic;
        });
        $(this).on("click", ".close-btn", function () {
            obj.find(".game-option").slideUp();
            obj.find(".option-btn").show();
            obj.find(".restart-btn").hide();
        });
        $(this).on("click", ".restart-btn", function () {
            settings.width = obj.find(".game-option .game-width").val();
            settings.height = obj.find(".game-option .game-height").val();
            settings.len = obj.find(".game-option .game-len").val();
            settings.minkinds = obj.find(".game-option .game-minkinds").val();
            settings.maxkinds = obj.find(".game-option .game-maxkinds").val();
            settings.duration = obj.find(".game-option .game-duration").val();

            scores.reset();
            countDown(0, gametimer);
            initContainer();
            initShow();
            obj.find(".game-option").slideToggle();
            obj.find(".option-btn").toggle(); $(this).toggle();
        });
    };

    let items = {'pic':   [['https://example.com/a1.jpg',
                            'https://example.com/a2.jpg',
                            'https://example.com/a3.jpg'],
                           ['https://example.com/b1.jpg',
                            'https://example.com/b2.jpg',
                            'https://example.com/b3.jpg',
                            'https://example.com/b4.jpg']],
                 'color': [['#000000', '#001a00', '#002700', '#003300', '#004d00'],
                           ['#000000', '#111111', '#222222', '#444444', '#555555'],
                           ['#000080', '#000099', '#0000b3', '#0000ff', '#3333ff'],
                           ['#0000ff', '#1a1aff', '#2e2eff', '#3333ff', '#4d4dff'],
                           ['#004d00', '#006600', '#008000'],
                           ['#006699', '#0077b3', '#0088cc'],
                           ['#009900', '#00b300', '#00cc00', '#00e600'],
                           ['#009973', '#00b386', '#00cc99', '#00dfa8'],
                           ['#00b300', '#00b311', '#00b333', '#00b355', '#00b366'],
                           ['#0d1a00', '#1a3300', '#264d00', '#336600', '#448800'],
                           ['#267326', '#2d862d', '#339933', '#39ac39', '#40bf40'],
                           ['#333399', '#3939ac', '#4040bf', '#5353c6', '#6666cc'],
                           ['#4d2600', '#663300', '#804000', '#994d00', '#b35900'],
                           ['#4da6ff', '#66b3ff', '#80bfff', '#99ccff', '#b3d9ff'],
                           ['#4dffd2', '#66ffd9', '#80ffdf', '#b3ffec', '#ccfff2'],
                           ['#53c653', '#66cc66', '#79d279', '#8cd98c', '#9fdf9f'],
                           ['#662900', '#803300', '#993d00', '#a34700', '#c44f00'],
                           ['#663d00', '#714400', '#804d00', '#995c00', '#9d5f00'],
                           ['#666600', '#7f7f00', '#808000', '#8f8f00', '#999900'],
                           ['#75a3a3', '#85adad', '#94b8b8', '#a3c2c2', '#b3cccc'],
                           ['#668cff', '#809fff', '#99b3ff', '#b3c6ff', '#ccd9ff'],
                           ['#66ffcc', '#80ffd4', '#99ffdd', '#b3ffe6', '#ccffee'],
                           ['#8600b3', '#9900cc', '#ac00e6', '#bf00ff', '#c61aff'],
                           ['#86b300', '#89b300', '#99cc00', '#9fcc00', '#ace600'],
                           ['#9999ff', '#b3b3ff', '#b9b9ff', '#bcbcff', '#ccccff'],
                           ['#a9ffa9', '#b3ffb3', '#bfffbf', '#ccffcc', '#cfffcf'],
                           ['#aaff80', '#bbff99', '#ccffb3', '#ddffcc', '#ddffcc'],
                           ['#b32d00', '#cc3300', '#e63900', '#ff4000', '#ff531a'],
                           ['#b34700', '#cc5200', '#e65c00', '#ff6600', '#ff751a'],
                           ['#b3b3e6', '#bcbce9', '#c6c6ec', '#d5d5f0', '#d9d9f2'],
                           ['#c1c1d7', '#c2c2d6', '#d0d0e1', '#d1d1e0', '#e0e0eb'],
                           ['#cc0000', '#e60000', '#ff0000', '#ff1a1a', '#ff2f2f'],
                           ['#cc0066', '#e60073', '#ff0080'],
                           ['#d1e0e0', '#e0ebeb', '#f0f5f5'],
                           ['#e699ff', '#ecb3ff', '#f2ccff'],
                           ['#e6f3ff', '#cce6ff', '#b3d9ff', '#99ccff'],
                           ['#e6ff99', '#ebffb9', '#ecffb3', '#f2ffcc'],
                           ['#ff00ff', '#ff1aff', '#ff33ff', '#ff4dff'],
                           ['#ff751a', '#ff8533', '#ff944d', '#ffa366', '#ffb380'],
                           ['#ff80bf', '#ff99cc', '#ffaad5', '#ffb3d9'],
                           ['#ff80ff', '#ff99ff', '#ffacff', '#ffb3ff', '#ffccff'],
                           ['#ffaa00', '#ffb31a', '#ffbb33', '#ffc34d'],
                           ['#ffb380', '#ffc299', '#ffd1b3', '#ffe0cc', '#fff0e6'],
                           ['#ffb399', '#ffc6b3', '#ffd9cc'],
                           ['#ffd699', '#ffe0b3', '#ffebcc'],
                           ['#ffdd99', '#ffe6b3', '#ffeecc'],
                           ['#ffff66', '#ffff80', '#ffff99', '#ffffb3', '#ffffcc'],
                           ['#ffff00', '#ffff1a', '#ffff33', '#ffff4d', '#ffff66'],
                           ['#ffff00', '#ffff33', '#ffff66', '#ffff99', '#ffffcc'],
                           ['#ffff80', '#ffff8f', '#ffff99', '#ffffa0', '#ffffb3']],
                 'num':   [[0,1,7,9], [2,3], [0,3,8], [0,4,8,9], [0,5,6,8], [0,8,9]],
                 'en':   [['b','d','h'], ['c','e','o'], ['e','s'], ['M','N','V','U','W'], ['m','n','v','u','w'], ['n','o'], ['G','O'], ['p','q','g'], ['K','k'], ['i','j','l','t'], ['X','x'], ['Z','z']],
                 'tw':   [['甲','由','申','田','用','甪'], ['伷','佃','抽','油','秞','牰','柚','袖','軸','妯'], ['伸','坤','砷','紳','珅','呻','柛'], ['中','忠','沖','冲','忡','仲','蚛','祌','肿'], ['一','二','三','冖','宀'], ['乀','乁','厂','口','囗','匚'], ['卡','卞','下'], ['佧','拤'], ['朱','未','末'], ['曰','臼','日','目','且','旦','白','百','自'], ['伯','柏','拍','怕','陌','泊'], ['昌','菖','猖','淐','倡','琩','唱','娼','錩','晿','裮'], ['大','太','犬','天','夫','矢','失','天','夭','夫','仧','禾','木','本','十'], ['大','水','氷','永','汞','衣'], ['冰','泳'], ['小','少','尐','尖','尛'], ['渺','測','側'], ['拴','栓','詮','銓','洤','佺','恮','姾','牷','硂'], ['全','金','荃'], ['卷','券'], ['蜷','埢','倦','惓','捲'], ['奎','奆'], ['父','女','交','文','又','叉','久','乆','支','攴','攵','欠','艾','丈','万','方'], ['狡','佼','姣','烄','校','晈','較'], ['扶','伕','伏','泆','佚','詄','昳','眣','呋','吠','仗'], ['溝','購','搆','媾','講','傋','構','煹'], ['五','丸','九'], ['朹','仇','扏','朹','犰','肍'], ['愀','湫','揪','煍'], ['佔','沾','怗','占','怙','祜'], ['琪','棋','淇','掑','帺','祺','旗','帺','掑','粸','娸'], ['誒','俟','埃','唉','挨'], ['楫','揖','緝','輯'], ['廏','厩','廄','廊'], ['撼','憾','感'], ['左','右','若','佐','拓','佑','祐'], ['上','土','士','上','下'], ['王','壬','玉','主','玍','圭','生'], ['子','孑','孓'], ['扒','仁','仨','化','芢','仩','仕','社'], ['什','計'], ['任','仼','衽','妊','妊'], ['九','力','刀','刃','刁'], ['叨','叼','仞','杒','屻','牣','肕','仞','肋','助'], ['兵','乒','乓','浜'], ['囧','冏'], ['回','同','向'], ['四','㘟','泗','柶','泂'], ['四','皿','血','罒'], ['西','酉','酋'], [,'徊','佪','惝','倘'], ['陑','栭','袻'], ['迥','逈','迴'], ['孩','孫','核','豥','骸','亥','絯','駭'], ['樁','椿'], ['龜','龜'], ['枝','妓','技','歧'], ['漩','璇','嫙','暶','䁢'], ['楳','媒','煤','禖','楣','湄','堳'], ['其','萁','具','見','貝','筧'], ['浩','皓','澔','淏','哠','悎','晧'], ['蠙','殯','嬪','儐','擯','濱'], ['被','披','陂','彼','波','玻'], ['暮','慕','募','幕','基','墓','寡'], ['扎','札','孔','玌','乳','䰲'], ['概','慨','溉'], ['麟','鱗'], ['恪','格','挌','狢','酪','絡','烙','落'], ['璐','潞','路'], ['攝','懾','聶','躡'], ['孽','孳','摰'], ['官','宮','宦'], ['呂','侶','梠','鋁','捛'], ['門','鬥'], ['根','恨','眼','很','限','垠','退','艮','琅','莨','鋃','桹','哴','浪','稂','踉','硠','駺','艆','狼','俍','良'], ['更','哽','梗','挭','埂','便','使','吏','史','兂'], ['邢','刑','形'], ['間','問','開','閱','闆','閤','閣','閑','閒','閘','闊','閭','閉','闔','閡','閥','闕','闗','關','闖','闇','鬦','鬪','鬭','鬨','闂'], ['僴','憪','鐧','澗'], ['潛','僭'], ['師','帥'], ['搿','掰'], ['稞','棵','惈'], ['仿','防','妨','枋','牥','坊','䄱','訪','紡','坊','昉','舫','汸','牥','蚄','鈁'], ['佛','彿','拂','沸','狒','坲','怫','昲','弗'], ['音','菩'], ['盧','蘆','慮','濾'], ['侯','候','猴'], ['奢','耆','著','箸'], ['眈','耽'], ['沈','沉','伔','枕','忱','抌','㚮','冗'], ['俋','挹','浥','邑'], ['芭','笆','琶','邑'], ['靶','把','耙','杷','跁','鈀'], ['僥','撓','繞','獟','鱙','驍'], ['禂','惆','倜','凋','淍','婤','徟','啁','賙','碉','琱'], ['悵','帳','脹','賬','漲'], ['幣','弊','斃'], ['陛','陸','㛬','逵','喹','楏'], ['粥','弼','弱','蒻','篛'], ['偌','婼','楉','渃','蹃','諾','喏','掿'], ['懦','糯','獳','儒','濡','蠕','孺','嚅','襦','曘','燸','獳','醹','鑐'], ['苕','笤','茗'], ['潴','瀦','豬','猪'], ['株','洙','侏','怽','祩','袾','姝','銖','蛛','誅','硃','殊'], ['衛','衕','街','衙','銜','衝','衡','術'], ['動','慟','勳','勛'], ['能','熊','態'], ['操','躁','燥','噪','譟','矂','藻','璪','繰'], ['疑','凝','譺','礙'], ['罣','罡'], ['擰','獰'], ['寧','薴','寜','寕'], ['暱','䁥'], ['躍','櫂','擢','曜','燿','耀','矅'], ['葉','僷','擛','鐷','瞸'], ['碟','蝶','弽','喋','牒','堞','鰈','蹀','揲','諜','鍱','楪','偞','煠','殜','惵','㻡','褋','鰈'], ['米','侎','洣','眯','脒','銤'], ['羋','芈'], ['華','樺','燁','嬅','曄','瞱','皣','墷','璍','㒯','嘩','譁','澕'], ['業','嶫','澲','礏','曗'], ['壄','懋','楙'], ['排','徘','俳','棑','非','緋','誹','菲','裶','㫵','渄','婔','啡','馡'], ['愧','槐','魂','魄','鬼'], ['鬽','鬾','鬿','魀','魁','魅','魆','魃','䰡','䰠','䰣','䰢','魈','魉','魊','魋','魌','魍','魎','魏','䰦','䰧','䰨','魐','魖','魑','魒','魓','魕','䰬','䰭','䰫','䰮'], ['魘','魔','魙','鼚','饕','餐'], ['靡','麼','嬤','糜'], ['陴','椑','婢','稗','裨','俾','牌','脾'], ['流','琉','硫','疏','旈','毓'], ['留','榴','媹','瑠','磂'], ['心','芯','苾','必','宓'], ['秘','祕','泌'], ['蜜','密','蔤','宻','嘧','滵','樒'], ['蔵','葳'], ['縷','樓','摟','簍','僂','漊','褸','塿','慺','髏'], ['抖','枓','阧','蚪','鈄','斛','斟','料','槲','嘝'], ['次','坎'], ['澄','證','燈','噔','璒','嬁','竳','鐙','橙'], ['揆','睽','暌','楑','湀','猤','癸','撥','發'], ['宇','字'], ['亭','享','停','婷','渟','楟','聤','蝏','諪'], ['脆','詭','佹','垝','姽','恑','祪','蛫','陒','桅'], ['藏','臧'], ['善','喜'], ['姊','姝','妹','妺','姉','姐'], ['紐','妞','扭','忸','杻','狃','炄','沑'], ['揭','愒','楬','掲','褐','渴'], ['階','楷','媘','偕'], ['溪','榽','奚','蹊','螇','蟋','徯','豯','鏭','騱','僁','嵠','豀'], ['希','稀','烯','唏','浠','俙','睎','琋','悕','桸','狶','豨'], ['振','賑','侲','娠','桭','蜄','誫','陙','辰','裖'], ['出','茁','拙','絀','屯','芚','丱','扸'], ['陣','陳','俥','倲','揀','倲','棟','凍','涷','蝀'], ['端','瑞','湍','貒','煓','猯','惴'], ['專','嫥','磚','膞','傅','傳','博','搏','溥'], ['數','敷'], ['陣','陳','俥','倲','揀','倲','棟','凍','涷','蝀'], ['軍','車','東','果','暈'], ['渾','琿','楎','餫','堚','䮝','諢','緷','輝','暉','煇'], ['灰','恢','詼','咴','拻','洃'], ['束','朿','棗'], ['捅','俑','桶','誦','蛹'], ['恫','桐','烔','垌','坰','挏','姛','詷','絧','硐','胴','峒','酮'], ['涸','凅'], ['笝','箇','峝','筒','筒'], ['棍','混','昆','崑','焜','琨','惃','猑','婫','輥'], ['焝','婚'], ['牲','性','姓','狌'], ['挑','佻','姚','桃','咷','洮'], ['匍','匐','萄','匋','甸'], ['脖','孛','桲','侼'], ['倖','悻','幸','婞','涬','垶','辛','莘','梓','亲'], ['緣','綠','椽','喙','豚','掾','蝝','䧘'], ['線','綿','婂','棉'], ['濂','濓','廉','簾'], ['幾','畿','譏','機','璣','磯','嘰','禨','襪','衊','蔑'], ['檄','激','繳'], ['醬','槳','奬','螿','漿'], ['醫','翳'], ['虯','糾','叫','訆','觓','朻'], ['夘','夗','卻','即','卸','御'], ['仰','抑','㚹','柳','卯'], ['投','股','坄','酘','骰','役','沒','設','穀','榖','杸','祋','毆','殿','羖','殷','般'], ['臨','頤','頗','願','類','頌','顯','頷','領','頦','額','順','顢','頇','預'], ['鼓','豉','頭'], ['穎','潁','頴'], ['傾','頃','澒','項'], ['敵','敗'], ['欣','欹','歆','歁','歇','歌','歓','歎','歡','觀','勸','勤'], ['視','蜆','觀'], ['獾','貛','嚾','懽','權','懼','讙','孉','巏','蠸'], ['比','此','北'], ['批','枇','妣','址'], ['薜','僻','辟','檘','避'], ['壁','璧','擘'], ['藍','籃','堅','監','檻','艦','鑑'], ['鏐','謬','膠','寥','憀','摎','寂','寥','参','參','嵾','摻','慘','滲','磣','墋','贂','醦'], ['以','似','娰'], ['液','腋','焲','掖','㖡'], ['紛','芬','帉','玢','岎','砏','衯','盼','吩','昐','扮','分','份','坋','秎','妢'], ['憤','僨','羵','膹','噴','墳','豶'], ['喬','橋','僑','轎'], ['縣','緜'], ['䄲','納','衲','鈉','吶','訥','魶','妠'], ['說','悅','稅','兌','涗','帨','挩','脫','蛻','娧','駾'], ['垂','捶','陲','棰','倕','娷','唾','睡','錘','綞'], ['槌','搥','鎚','追','磓'], ['樵','憔','撨'], ['蛇','佗','沱','陀','坨','柁','袉','岮','鉈','叱','吒'], ['他','祂','牠','她','地','池','彵'], ['乜','也','七','亡','芒','它','匕'], ['檢','撿','儉','臉','殮','險','瞼'], ['歛','斂','劍'], ['淖','掉','倬','焯','婥'], ['純','鈍','吨','忳','飩','豘','魨'], ['為','偽','噅'], ['差','羞','豢','養','眷','秦','泰','蓁','奏','奉'], ['射','肘','對','付','忖'], ['豺','犲','材','財'], ['的','皎'], ['豹','釣','約','的','妁','魡'], ['袍','泡','砲','皰','炮','抱','咆','匏','鞄','狍','跑','軳','齙','胞','鉋','靤','苞','骲','鮑'], ['牛','午','羊'], ['己','已','巳','乙'], ['住','柱','往','徃','挂','袿','妵','蛀','拄','佳','隹','圭'], ['驒','駞','翩','騙','翻'], ['翎','翗','翊','羽'], ['番','藩','蟠','磻','蕃','璠','燔','墦','憣','橎','羳','膰','襎','蹯','鐇','潘','幡'], ['香','杳','呇','咨'], ['梁','粱','樑','柒'], ['价','扴','介'], ['州','洲','卌','川','巛','瓜','爪','廾'], ['弧','孤','狐','瓢','㼋','㼍','瓡','䝖'], ['卜','补','朴','圤'], ['衤','礻'], ['沙','吵','妙','秒','炒','抄','杪'], ['莏','莎'], ['惕','楊','揚','陽','場','暘','禓','湯','婸','㛫'], ['殤','傷'], ['魯','櫓','嚕','撸'], ['廷','延'], ['娜','椰','揶','挪','哪','那','耶','郎','瑯','榔','螂'], ['滷','鹵','蓾','卣'], ['國','園','圈','團','圑','圓','圖','㘣','圃','圊','圏','圉','圌','圍','圎','圐','圔','圕','圗','圙','㘤','圚','圛','圜','㘥','圝','圞'], ['因','团','困','囚','四','囜','囝','囹','龱','図','囘','囙','㘝','回','囟','囡','団','㘟','囤','囥','囦','囧','囨','囩','囪','囫','囬','园','囮','囯','囱','囲','囶','囷','囸','固','囻','囼','国','图','㘠','㘡','囹','囿','㘢','圀','圅','圁','圂','圄'], ['踐','賤','棧','俴'], ['癡','痴','痂','瘸','病','痛','癌'], ['椅','倚','犄','崎','綺','碕','琦','猗','漪'], ['牆','嬙','檣','墻'], ['福','偪','愊'], ['忐','忑'], ['凹','凸'], ['無','蕪'], ['荃','筌'], ['悟','梧','牾','浯','焐','捂'], ['或','彧'], ['城','域','減','减','成','咸','威','荿','茂'], ['式','武','拭','試','侙','軾'], ['加','茄','伽','枷','咖','㚳'], ['眡','眂'], ['伐','代','找','俄','娥','蛾','我'], ['和','如','知'], ['警','譬','幫'], ['換','煥','渙','喚'], ['桌','卓','阜','草'], ['早','旱','星'], ['腥','猩','惺','煋','瑆','鍟','捏','揑','涅'], ['興','輿','與'], ['倍','陪','焙','碚','賠','培','碚','踣','掊','棓','涪','婄'], ['龍','籠'], ['偶','隅','楀','偊','瑀','渪','禹'], ['要','耍','恧'], ['螢','營','熒','塋','滎','瑩'], ['隋','惰','隨','髓','鰖'], ['兒','児','兕','兄'], ['猊','堄','倪','棿','睨'], ['祇','衹','扺','忯','低','彽','抵','牴','柢','阺','眂','眡'], ['拌','伴','絆','畔'], ['古','舌','告','吾'], ['估','咕','沽','詁','佔'], ['恬','括','活','話','咶'], ['甜','鉗','姏','拑','紺'], ['扔','奶','仍'], ['薇','微'], ['丐','丏'], ['佈','怖','㚴','㘵','㳍','抪','沛','柿','肺'], ['步','歨','捗','徏','埗'], ['蔀','篰'], ['受','爰','㸔','妥','荌','愛','憂','夏'], ['擾','優','櫌','懮'], ['苟','茍','筍','荀','笴'], ['負','員','貢','資','貲','貸','貨','賃','背','胃','冑','腎'], ['肙','絹','捐','狷','涓','娟','殞','損','隕'], ['偵','禎','楨','媜','揁','湞'], ['直','真'], ['栱','拱','洪','共','哄','晎','烘'], ['斤','斥'], ['折','忻','沂','祈','蚚','圻','拆','昕','盺','訢','訴','柝','所','䰺'], ['蜥','晰','淅'], ['侍','待','持','特','峙','寺','時'], ['掙','睜','淨','凈','竫','諍','崢','猙','埩'], ['槍','搶','倉','滄','傖','嵢','艙','凔'], ['盲','肓'], ['衰','蓑'], ['楠','暔','諵','喃','蝻','婻','南'], ['丙','兩','炳','柄','陃','倆','滿','顢'], ['裁','烖','栽','哉','載','戴'], ['敝','敞','敬'], ['梯','悌','娣','稊','綈'], ['樀','摘','嫡','讁','蹢','滴','嘀','熵'], ['底','厎'], ['藉','籍'], ['起','超'], ['互','亙'], ['貳','貮'], ['風','虱'], ['鳳','凰'], ['謅','芻'], ['崇','祟'], ['剌','刺','敕'], ['徒','徙','陡'], ['績','續'], ['准','淮','雄','雞','稚','雅'], ['義','羲'], ['幹','斡'], ['膽','瞻','擔','澹','勝','謄','詹'], ['復','複','愎','椱'], ['悄','梢','捎','稍','俏','逍'], ['宄','究','空','穾','窒','室','穸'], ['控','倥','埪','崆','涳','椌','悾','硿','鞚'], ['當','堂','棠','裳'], ['裏','裹','襄','囊'], ['提','堤','媞','隄','禔','惿','瑅','偍','睼','碮','蝭'], ['松','訟','忪','伀','妐','彸','炂','衳'], ['卦','褂','掛'], ['眨','貶','姂'], ['旡','牙'], ['諦','締','啼','蹄','崹','腣','帝','媂'], ['卿','唧','鄉','聊'], ['暸','嘹','膫','瞭'], ['燎','憭','僚','獠','撩','嫽','鐐'], ['管','菅'], ['巨','臣','佢','拒'], ['夕','汐'], ['廁','厠'], ['勞','嘮','撈','嶗','僗','澇','磱','蟧','鐒','髝','橯','耢','耮','軂'], ['斑','班'], ['芮','笍','苪','茜'], ['陶','掏','淘','祹','裪','啕'], ['衷','哀','袁','表'], ['議','儀'], ['免','兔','冤'], ['晚','挽','輓','睌','脕','娩','梚','鋔','鞔','逸'], ['苑','死','宛','箢'], ['琬','碗','婉','腕','畹','埦','倇','椀','啘','睕','綩','蜿','踠','椀'], ['人','入','八'], ['燔','播','襎','僠','橎','潘'], ['拼','拚'], ['偉','幃','禕','韋','葦'], ['傭','慵','庸'], ['貌','猊'], ['育','青','菁'], ['倩','情','清','凊','請','睛','晴','靖'], ['滑','猾','搰','骨'], ['冠','寇'], ['書','畫','晝'], ['鬍','鬚','髯','髮','髪'], ['戒','戎'], ['戌','戍','戊'], ['遣','遺'], ['侮','梅','悔','海'], ['壺','壼'], ['肄','肆'], ['治','冶','怡','胎','洽','拾','袷','哈'], ['撤','撒','徹'], ['辮','辦','辯','辬'], ['綱','鋼','堈','掆','棡','犅','碙','罁','惘','棢','網','罔','岡'], ['競','兢'], ['貪','貧','薈','會','曾','瞢','麥','夢','賞'], ['膾','鱠','儈','澮','禬'], ['劊','鄶'], ['增','憎','繒','嶒','噌','熷','橧','璔','矰','驓','僧','㽪','贈'], ['寶','罾','竇','賣','實','賽'], ['賈','買','賣'], ['署','暑','薯'], ['囑','矚','屬'], ['湖','瑚','蝴','糊','楜','猢','媩','鍸'], ['家','傢','冢','蒙','濛','檬','朦','懞','曚','矇','幪'], ['炙','炙'], ['安','按','桉','咹','洝','垵','侒','峖'], ['并','幷','井','丼'], ['丯','丰','乇','毛','手'], ['你','妳','祢'], ['秉','兼'], ['贏','羸'], ['屎','尿','屍','犀','屖'], ['撕','斯','嘶','凘'], ['丅','丁','千','干','于'], ['打','扙','扞','杆','犴','玕','忏','㶥','奸','㚥','奷','仟','仠','阡','扦','仵','件','忤','汼'], ['笑','筊','笨','苯','茶','荼','苓','岑'], ['余','佘'], ['侃','祝','拀','柷'], ['妤','玗','伃','佇','予','圩','杅','汙','弙','衧','竚','坾','紵','羜'], ['仱','伶','玲','鈴','羚','姈','拎','袊','蚙','趻','黔','扲','鈐','岒','仱','忴','彾','聆','怜','昤','朎','狑','秢','炩','竛','柃','岭','皊','吟','泠','冷','令','今'], ['乞','吃','迄','䰴'], ['泥','坭','呢','柅','狔','昵','胒'], ['抰','快','袂','決','泱','秧'], ['冮','江','扛','杠','扗','杜','肚','肛','妅','虹','紅','缸','舡','釭','魟','訌','仜'], ['莊','荰','荏'], ['媧','渦','過'], ['錯','惜','昔','借'], ['倫','掄','棆','惀','陯','㷍','淪','溣','婨','埨','睔','輪','鑰'], ['崙','侖','菕'], ['偷','愉','榆','揄','瑜','蝓','褕','媮','踰','輸','堬','渝','諭','逾'], ['鳥','烏','梟','爲'], ['鳩','鳪','鳭','鳮','鳰','䲧','䲨','䲪','鳱','鳲','鳵','鳲','鳽','䲭','䲮','䲯','䲰','䲲','䲳','䲴','䲸','鳾','鳷','鳹','鳺','鳻','鳼','鴎','鳾','鳿','鴀','鴋','鴁','鴂','鴄','鴅','鴆','鴇','鴉','鷗','鴉','鶬','䲹','䲺','䲻','䲼','䲽','䲿','䳂','䳄','䳇','䳉','䳊','鴊','嗚','鳴','鴝','鴞','鴟','鴪','鴫','鴒','鴓','鴔','鴖','鴗','鴘','鴙','鴠','鴡','鴢','鴣','鴧','鴨','鴩','鴣','鶇','䳎','䳋','䳌','䳍','䳎','䳏','䳑','䳓','鴭','鴮','鴯','鴺','鴻','鴾','鴿','鴰','鴱','鴲','鴳','鴴','鴵','鴶','鴸','鴹','鵂','鵃','鵄','鵅','鵇','鵈','䳕','䳙','䳚','䳛','䳜','鵊','鵋','鵍','鵎','鵏','鵚','鵛','鵜','鵝','鵐','鵑','鵒','鵓','鵕','鵖','鵗','鵘','鵙','鵠','鵡','鵢','鵣','鵯','鵧','䳝','䳞','䳟','䳠','䳡','䳢','䳤','䳥','鵪','鵫','鵬','鵭','鵮','鵯','鵺','鵼','鵽','鵾','鶊','鶋','鶌','鶍','鶎','鶏','鵧','鵨','鵩','鵰','鵱','鵲','鵳','鵴','鵵','鵶','鵷','鵸','鶂','鶄','鶅','鶆','鶇','鶈','鶉','鵡','鵮','䳭','䳦','䳨','䳩','䳪','䳫','䳬','䳯','䳰','鶚','鶛','鶜','鶝','鶞','鶟','鶐','鶒','鶓','鶔','鶕','鶗','鶘','鶙','鶠','鶡','鶢','鶣','鶤','鶥','鶧','鶨','鶪','鶫','鷀','䳳','䳴','䳵','鶬','鶮','鶰','鶲','鶴','鶵','鶶','鶷','鶸','鶹','鶺','鶻','鶼','鶽','鷀','鷁','鷂','鷃','鷄','鷅','鷆','鷉','鷊','鷍','鷎','鷏','䳺','䳽','鷋','鷐','鷑','鷒','鷓','鷚','鷛','鷜','鷝','鷞','鷚','䳾','䳿','䴀','䴁','䴂','䴃','䴄','䴅','䴆','鷡','鷣','鷤','鷦','鷧','鷨','鷫','鷬','鷭','鷮','鷯','鷱','鷼','鷳','鷴','鷵','鷶','鷷','鷸','鷯','䴊','䴇','䴈','䴉','鷾','鸀','鸊','鸂','鸅','鸆','鸇','鸈','䴍','鸋','鸍','鸏','鸐','鸓','䴏','鸕','鸖','鸚','鸘','鸙','鸘','鸛','鸜','鸝','䴐','䴑','䴒'], ['䰲','䰳','魛','魜','魝','魞','䰴','䰵','䰶','魟','魠','魡','魢','䰺','䰻','䰼','䰽','䰾','䱽','䰷','䰸','䰹','魪','魫','魬','魭','魮','魣','魤','魥','魦','魧','魨','魩','魰','魱','魲','魳','魴','魵','魶','魷','魸','魹','䰿','鮣','䱀','䱁','䱂','䱃','䱄','䱅','䱆','䱇','䱈','䱉','魺','魻','魼','魽','魾','魿','鮊','鮋','鮌','鮍','鮎','鮏','鮀','鮁','鮂','鮃','鮄','鮅','鮇','鮈','鮉','鮐','鮑','鮒','鮓','鮔','鮕','鮖','鮗','鮘','鱸','䱊','䱋','䱌','䱍','䱎','鮚','鮛','鮜','鮞','鮟','鮙','鮠','鮡','鮢','鮥','鮦','鮧','鮨','鮩','鮪','鮫','鮬','鮭','鮮','鮯','鮰','鮱','鮲','鮳','鮴','鱭','鮫','鮮','鱘','鮭','鮚','鮳','鮪','鮞','鮦','鰂','鮜','䱏','䱐','䱑','䱒','䱓','䱔','䱕','䱖','鮵','鮶','鮷','鮸','鮹','鮻','鮼','鮽','鮾','鮿','鯀','鯁','鯂','鯃','鯄','鯅','鯆','鯇','鯉','鯋','鯌','鯍','鯎','鯏','鯐','鯑','鯒','鯓','鯽','鯁','鱺','鰱','鰹','鯉','鰣','鰷','鯀','鯇','鮶','鯽','鯒','䱚','䱛','䱜','䱝','䱞','䱟','䱪','䱙','䱠','䱡','䱢','䱣','䱤','䱦','䱧','䱨','䱩','鯔','鯕','鯖','鯘','鯙','鯚','鯛','鯜','鯝','鯞','鯟','鯠','鯡','鯢','鯣','鯤','鯥','鯦','鯧','鯨','鯩','鯪','鯫','鯭','鯮','鯯','鯰','鯱','鯲','鯳','鯴','鯻','鯖','鯪','鯕','鯫','鯡','鯤','鯧','鯝','鯢','鯰','鯛','鯨','鰺','鯴','鯔','䱫','䱬','䱭','䱮','䱯','䱰','䱱','䱲','䱳','䱴','鯶','鯷','鯸','鯹','鯺','鯼','鯾','鯿','鰀','鰊','鰋','鰌','鰍','鰎','鰏','鰁','鰚','鰛','鰂','鰃','鰄','鰅','鰆','鰇','鰈','鰉','鰐','鰑','鰔','鰕','鰖','鰗','鰘','鰙','鰠','鱝','鰈','鱨','鰛','鰃','鰓','鰐','鰍','鰒','鰉','鰁','鱂','鯿','鰠','䱺','䱻','䱼','䱽','䱵','䱶','䱸','䱹','䲤','鰜','鰝','鰞','鰟','鰪','鰫','鰬','鰭','鰮','鰯','鰡','鰢','鰣','鰤','鰥','鰦','鰨','鰩','鰰','鰏','鰭','鰨','鰥','鰩','鰟','鰜','䱾','䱿','䲁','䲂','䲃','䲄','䲅','䲆','䲇','䲈','鰺','鰻','鰼','鰽','鰾','鰿','鰱','鰳','鰶','鰷','鰸','鰹','鱁','鱂','鱃','鱄','鱅','鱆','鱇','鱈','鰳','鰾','鱈','鰻','鱅','䲁','鰼','䲊','䲋','䲌','䲍','䲎','䲏','䲉','鱊','鱋','鱌','鱍','鱎','鱏','鱚','鱛','鱐','鱑','鱒','鱓','鱔','鱕','鱖','鱗','鱘','鱙','鱖','鱔','鱗','鱒','鱗','䲐','䲑','䲒','䲓','䲔','䲕','鱜','鱝','鱞','鱪','鱫','鱠','鱡','鱢','鱣','鱤','鱥','鱦','鱧','鱩','鱯','鱤','䲖','䲗','䲘','鱬','鱭','鱮','鱯','鱨','鱰','䲙','鱱','鱲','鱳','鱴','鱵','鱶','䲚','䲛','鱷','鱸','鱹','鱺','䲜'], ['豸','豹','豺','豻','豼','豽','䝖','䝗','䝘','豾','豿','貀','貁','貂','貃','䝚','䝛','貊','貄','貅','貆','貇','貈','貉','貋','貌','貍','䝜','貎','貏','䝝','䝞','貐','貑','貒','貓','䝟','貔','貕','貖','䝠','貗','貘','貙','䝡','䝢','貚','䝣','䝤','䝥','䝦','貛','貜'], ['冃','冄','冉','再'], ['甫','甬','莆'], ['甭','恿','勇'], ['補','捕','埔','鋪','舖','哺','餔','浦','蒲','烳','誧','脯'], ['樸','獛','璞','僕','濮','墣','蹼','幞','獛','穙','襆','襥','鏷','鎂'], ['逢','縫','峰','蜂','烽','鋒','桻'], ['遂','逐','隊'], ['熱','熟','塾','墊'], ['馬','焉','碼','馮','瑪','螞','溤','傌','嗎','鎷','媽','嫣'], ['駕','駑'], ['糴','糶'], ['奠','尊','奐'], ['壇','檀','擅','憻','鱣'], ['簟','簞','覃','單','彈','憚','禪','嬋','殫','僤','潬','暺','貚','潭','譚','嘾','墰','罈','憛','橝','驔'], ['談','惔','婒','啖','菼','炎','淡','啖'], ['賭','睹','堵','陼'], ['幌','熀','榥','晃','滉','愰'], ['煌','隍','惶','湟','徨','堭','蝗','偟','喤','媓','崲','揘','瑝','艎'], ['先','光','冼','洗','恍','洸','晄','姺'], ['冿','津','律','珒','筆','聿','嵂','葎'], ['迭','送'], ['繩','憴','渑','譝','蠅','鱦'], ['巒','臠','戀','鑾','鸞','攣','欒','孿','孌','灤','曫','灓','變','樂'], ['僵','橿','殭','壃','彊','疆','礓','繮'], ['鐘','鍾','種','腫','踵','歱','偅','堹','湩','媑','褈','諥','緟'], ['懂','僅','謹','瑾','饉','墐','慬','嫤','殣'], ['董','蕫','菫','堇','蓳','童','重','黃','簧','葟','薑','薹'], ['穔','磺','璜','潢','獚','墴','撗','穔'], ['凙','澤','墿','燡','嶧','譯','鐸'], ['促','促','捉'], ['涼','凉','京','椋','綡','掠','椋','黥','諒','㹁'], ['連','蓮','運'], ['檯','擡','嬯'], ['臺','壹'], ['獨','濁','鐲'], ['鶱','騫','賽','蹇','躉'], ['體','醴','禮','澧'], ['經','涇','徑','脛','輕','逕'], ['像','橡','象','襐','豫','潒'], ['氏','氏','氐'], ['窘','窮'], ['尸','戶','户','戸'], ['淚','戾','捩'], ['憶','億','燱','嬑'], ['萊','箂','夾','爽','莢'], ['摺','熠'], ['電','雷','雲','雯','霎','霑'], ['澉','橄','瞰','陬','諏','敢','取','驟','聚','娵'], ['舟','丹','母','毋','丑'], ['舟','珘','洀','烐','矪'], ['稈','悍','桿','捍','娨'], ['深','探','琛'], ['嗔','瞋','謓','搷','慎','愼','縝','禛','鎮','滇','傎','嵮','齻'], ['萌','崩','明','朝','棚'], ['朋','册'], ['炸','柞','作','拃'], ['浹','唊','蛺','挾','挟','梜','狹','俠','峽','陜','䀹'], ['假','徦','瑕','葭','犌','猳','腵','豭','貑','婽','嘏'], ['板','扳','仮','阪','版','昄','皈','返'], ['魬','飯','粄','鈑','粄','舨','服'], ['恩','思'], ['垃','拉','啦','泣','立','位'], ['圾','級','及','汲','扱'], ['考','考','孝','荖'], ['烤','考','拷','栲','咾','姥','銠','恅','狫'], ['浮','垺','俘','琈','蜉','埒','脟','捋','寽'], ['游','旂','蝣','旖','旎'], ['兀','元','六','允','充'], ['正','芷','止'], ['柯','何','抲','河','訶','呵','伺','妸','㚸'], ['司','可','句','勾','勺','芍','匃','匄'], ['爿','片','弓'], ['弓','宆','穹','芎']],
                 'rel':   [[['菠菜','絲瓜','紅茶','竹筍','綠豆','雞蛋','椰樹','黑守瓜','黃守瓜'],
                            ['蘋果','青蘋果','芒果','奇異果','人參果','蛇皮果','金燈果','金星果','百香果','黃晶果','歐楂果','諾麗果','泡泡果','火龍果','神秘果','番茄','水梨','酪梨','西洋梨','芭樂','芭蕉','香蕉','大蕉','木瓜','西瓜','香瓜','哈密瓜','柳橙','酸橙','橘子','椪柑','蜜柑','桶柑','四季柑','日向夏','金桔','釋迦','鳳梨','楊桃','獼猴桃','仙桃','桃子','柿子','李子','山荊子','棗子','椰子','柚子','葡萄柚','水蜜桃','櫻桃','葡萄','樹葡萄','榴槤','橄欖','波羅蜜','蓮霧','荔枝','蘭撒','龍眼','草莓','藍莓','覆盆子','黑莓','茅莓','桑椹','楊梅','枇杷','枸櫞','檸檬','水檸檬','香檬','甜萊姆','侯購諜','紅毛丹','黃皮','山竹','甘蔗','石榴']],
                           [['櫻花','雞蛋','打拋肉','鍋鏟','菜刀','菜販','肥料','黑守瓜','黃守瓜'],
                            ['菠菜','空心菜','龍鬚菜','過貓','川七','高麗菜','大白菜','小白菜','花椰菜','西蘭花','芹菜','香菜','豆芽菜','茼蒿','茴香','莧菜','萵苣','塌棵菜','蒲菜','菜心','油菜','薺菜','芥菜','苤藍','捲心菜','抱子甘藍','紫甘藍','羽衣甘藍','芥藍','番薯','馬鈴薯','山藥','芋頭','西洋菜','水芹','蔥','青蔥','分蔥','樓子蔥','蒜頭','洋蔥頭','韭菜','韭蔥','薤','大豆','四季豆','毛豆','皇帝豆','豌豆','蓮藕','茭白筍','麻竹筍','桂竹筍','冬筍','蓴菜','猴頭菇','杏鮑菇','金針菇','茄子','大黃瓜','小黃瓜','絲瓜','瓠瓜','冬瓜','苦瓜','南瓜','南瓜','黃瓜','辣椒','枸杞','玉米','薑','香椿','山葵']],
                           [['義大利','巴西','加拿大','紐西蘭','奧地利','蘇格蘭','埃及'],
                            ['臺灣','日本','中國','韓國','朝鮮','印度','斯里蘭卡','寮國','菲律賓','印度','印尼','新加坡','馬來西亞','越南','緬甸','泰國','柬埔寨','巴基斯坦','巴勒斯坦','以色列','伊朗','伊拉克','孟加拉','不丹','蒙古','杜拜','黎巴嫩','約旦','科威特','卡達','巴林','阿曼','沙烏地','敘利亞','阿布達比','葉門','阿富汗','塞普勒斯','尼泊爾','馬爾地夫','烏茲別克','吉爾吉斯','塔吉克','土庫曼','哈薩克']],
                           [['紐約','胡志明市','釜山','伊斯坦堡','南京','名古屋','紐西蘭','溫哥華','烏魯木齊'],
                            ['臺北','華盛頓','平壤','北京','柏林','莫斯科','巴黎','曼谷','馬德里','雅典','金邊','渥太華','羅馬','新德里','雅加達','倫敦','河內','永珍','杜哈','聖喬治','安卡拉','馬尼拉','基多','哥本哈根','里斯本','加德滿都','華沙','巴西利亞','達卡','開羅','都柏林','維也納','大馬士革','奈洛比','里加','貝魯特','奈洛比','威靈頓']],
                           [['臺北市','嘉義市','南投'],
                            ['基隆市','新北市','桃園','新竹','苗栗','雲林','嘉義縣','臺南','高雄','屏東','宜蘭','花蓮','臺東','澎湖','連江']],
                           [['文山','梅山','圓山','方文山'],
                            ['玉山','陽明山','觀音山','合歡山','大尖山','二尖山','阿里山','柴山','半屏山','太平山','象山','大龍峒山','獅山','虎山','豹山','雪山','大雪山','秀姑巒山','馬博拉斯山','中央尖山','東小南山','東郡大山','大水窟山','南湖大山','南湖北山','穆特勒布山','劍山','雲峰','南華山','奇萊山','關山','向陽山','大霸尖山','巴巴山','馬西山','三叉山']],
                           [['狒狒','猩猩','鴕鳥','老鷹','鱷魚','蛇','蜘蛛','椿象','菊虎'],
                            ['山羌','山羊','羊駝','綿羊','大角羊','蠻羊','水牛','氂牛','牛羚','蹬羚','美洲野牛','梅花鹿','水鹿','麋鹿','大象','疣豬','獒犬','土狗','鬣狗','灰狼','豺狼','藏狼','狐狸','老虎','犀牛','斑馬','長頸鹿','灰熊','北極熊','獵豹','花豹','雲豹','雪豹','獅子','野馬','駱駝','驢子','騾','駱馬','藪貓','獰貓','兔子','老鼠','豹貓','家貓','樹懶','袋獾','穿山甲','食蟻獸']],
                           [['柳穿魚','章魚','墨魚','鮑魚','魷魚','鱟','星魚','鱷魚','鯨魚','海豚','甲魚'],
                            ['鮭魚','錦鯉','石斑','白鯊','虎鯊','角鯊','鯨鯊','電鱝','鬼魟','斑甕鰩','燈籠魚','白鯧','鱸魚','鯛魚','紅目鰱','土魠魚','彈塗魚','盲鰻','銀鮫','鳶鱝','花鰻鱺','管鼻鯙','石蛇鰻','鳳鱭','長鰳','黃鯽','稜鯷','寶刀魚','盾齒鰶','花點鰣','沙丁魚','鬚鱲','虱目魚','比目魚','翻車魚','白帶魚','小丑魚','圓吻鯝','高身鯽','紅鰭鮊','銀鮈','團頭魴','鼠鱚','泥鰍','鬍鯰','金魚','大肚魚']],
                           [['豆芫菁','菊虎','爆米花','蛋花'],
                            ['跳舞蘭','劍蘭','紫羅蘭','燈仔花','牽牛花','康乃馨','玫瑰花','菊花','茉莉花','向日葵','聖誕紅','鳳仙花','紅丁香','百日草','蓮花','荷花','虞美人','茉莉花','亞麻','柳穿魚','滿天星','薰衣草','野薑花','勿忘我','桂花','茶花','石竹','含笑花','鳶尾花','水仙花']],
                           [['貓熊','浣熊','蝙蝠'],
                            ['袋犬','負鼠','鼩負鼠','智魯負鼠','袋鼬','袋獾','袋狼','袋狸','袋鼴','無尾熊','袋熊','紋袋貂','袋鼠','蜜袋鼯']],
                           [['蝙蝠','鴕鳥'],
                            ['貓頭鷹','麻雀','獵鷹','白鴿','白鷺鷥','海鷗','鸚鵡','畫眉鳥','啄木鳥','琵鷺','烏鴉','喜鵲','隼','鵰','鵟','鳶','鷲']],
                           [['犀牛','山羊','大象','斑馬','牛羚','菊虎','咬人貓'],
                            ['老虎','獅虎','獅子','獵豹','花豹','雲豹','雪豹','獒犬','土狗','鬣狗','灰狼','豺狼','藏狼','狐狸','藪貓','獰貓','灰熊','北極熊','疣豬','袋獾']],
                           [['蜈蚣','馬陸','蜘蛛','蚯蚓'],
                            ['獨角仙','鍬形蟲','糞金龜','步行蟲','瓢蟲','金花蟲','鐵甲蟲','螳螂','蟋螽蟴','蟋蟀','蚱蜢','金鈴子','稻蝗','蚊子','果蠅','水黽','椿象','天蛾','尺蛾','蠶','蝴蝶','蜜蜂','蛛蜂','水虻','毛毛蟲','火蟻','白蟻','螞蟻','蜻蜓','細蟌','蹣蟌','幽蟌','珈蟌','琵蟌','絲蟌','蠟蟬','草蟬','蟪咕','菱飛蝨','蚜蟲','灶馬','露斯','螽斯','大剪斯','棘腳斯','細蟴','螽蟴','擬騷斯','椿象','蠶寶寶','黑守瓜','黃守瓜','虎甲蟲','象鼻蟲','叩頭蟲','吉丁蟲','天牛','豆芫菁','螢火蟲','菊虎','竹節蟲','葉脩','星蛟蛉','長角蛉','螳蛉','扁蠊','斜蠼螋','石蛃','蜉蝣','衣魚','囓蟲']],
                           [['鯊魚','貓頭鷹','獅子','貓熊','袋鼠','蟑螂','螞蟻'],
                            ['青蛙','蟾蜍','烏龜','海龜','鱷魚','蛇','寄居蟹','螃蟹','彈塗魚','娃娃魚','海狗','海豹','海獅','海象','水獺','蠑螈','河馬','蚓螈','大鯢','小鯢','洞螈','科摩多龍','蜥蜴','企鵝','鵜鶘','鵝','鴨','鴛鴦']],
                           [['岳飛','扁鵲','鄭經','劉基','劉邦','張良','韓信','蕭何','商鞅','項羽','陳平','公孫鞅','公孫衍','李煜','吳廣','陳勝'],
                            ['劉備','關羽','張飛','曹操','荀彧','郭嘉','張遼','何進','董卓','呂布','華雄','丁奉','高順','侯成','郝萌','孔融','張角','鄧茂','程志遠','陳宮','孫堅','公孫讚','馬騰','馬超','張魯','嚴白虎','顏嚴','黃忠','陸遜','徐晃','趙雲','簡雍','周瑜','孫策','孫權','黃蓋','張昭','太史慈','許褚','夏侯淵','夏侯惇','夏侯霸','姜維','魏延','孟獲','諸葛亮','袁紹','田豐','沮受','文醜','顏良','潘鳳','淳于瓊','袁術','劉表','劉琦','蔣幹','蔡瑁','華佗','陶謙','龐統','龐德','鍾會','鄧艾','甘寧','司馬懿','司馬昭','司馬炎','曹丕','曹仁','曹植','曹叡','糜芳','劉焉','馬謖','馬良','王平','張任','典韋','王允','王朗','典韋','孫乾','陳登','曹豹','劉禪','黃權','李嚴','費禕','王雙','馬岱']],
                           [['張昭','孔明','劉秀','孔融','華佗','馬良','陳登','曹豹','淳于瓊','公孫淵','司馬炎','李煜'],
                            ['公孫鞅','張儀','公孫衍','陳軫','范雎','呂不韋','李斯','蒙毅','樂池','公子虔','胡蘇','魏冉','公孫淵','公子卬','司馬錯','烏獲','孟賁','孟卯','白起','王齕','蒙武','張唐','蒙恬','王翦','趙良','扁鵲','趙高','魏斯','魏遫','季成','魏無忌','任章','趙葭','惠施','卜商','吳起','西門豹','龐涓','侯嬴','朱亥','嚴遂','聶政','趙雍','趙勝','徐越','藺相如','廉頗','李牧','趙括','屈原','吳起','項燕','蘇秦','華佗','樂毅','蘇代','鄒衍','郭隗','傅豹','蘇射','蘇秦','田光','荊軻','高漸離','秦舞陽','田布','淳于髡','孫臏','田單','西施','范蠡','曾參','端木賜','子柳','豫讓','田文','田喜','劇辛','栗腹','秦開','王容','樊於期','鄭袖','黃歇','景差']],
                           [['農夫','商人','漁夫'],
                            ['警察','消防員','軍人','法官','檢察官','外交官','老師','稅務員']],
                           [['霾'],
                            ['水','冰','河','海','湖','霧','江','川','雨','雲']],
                           [['牛奶','羊奶'],
                            ['咖啡','烏龍茶','豆漿','冬瓜茶','菊花茶','楊桃汁','燒仙草','人蔘茶']],
                           [['鐵鎚','水龍頭','電車','鍋鏟','香爐','鐮刀','烤肉醬'],
                            ['文件夾','迴紋針','圖釘','釘書機','墊板','書套','鉛筆','原子筆','橡皮擦','修正帶','修正液','白板','電話','電腦','時鐘','打卡機','印表機','影印機','傳真機','便利貼','複寫紙','筆記本','隨身碟','名牌','書籤','夾子','印泥','磁鐵','延長線']],
                           [['刮鬍刀','水龍頭','推車','自行車','火爐','手扶梯','鋸子','織布機'],
                            ['電風扇','時鐘','電腦','休旅車','飛機','微波爐','氣炸鍋','冷氣','電鍋','電扶梯','手電筒','手機','電話','電鋸','電捲門','路燈','照相機','理髮機','掃描器','音響','麥克風','耳機','影印機']],
                           [['硯台','雨傘','醬油','雞蛋'],
                            ['鑄鐵鍋','菜刀','砧板','水龍頭','抹布','水槽','冰箱','電鍋','飯匙','陶盤','筷子','打蛋器','鍋鏟','菜瓜布','清潔劑','烤箱','微波爐','洗碗機','湯匙','量杯']],
                           [['磁浮列車','飛機','輪船','渡輪','遊艇'],
                            ['單車','機車','電動機車','轎車','休旅車','計程車','高鐵','火車','電車','公車','遊覽車','貨車','砂石車','油罐車','聯結車','水肥車','救護車','垃圾車','警車','手推車','接駁車','壓路機','挖土機','吊車']],
                           [['牛','雨','木','花','虎','熊','水','子','山','林','土','市'],
                            ['頁','貝','口','克','車','東','品','冒','甲','西','西','良','吸','貓','馬','狗','魚','狼','獅','鳥','鬼','象','鍋','豆','昌','日','月','星','蘭','草','備']],
                           [['由','肆','卵','成','仁','酋','更','末'],
                            ['甲','乙','丙','丁','戊','己','庚','辛','壬','癸','子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥']],
                           [['0','1','4','70','15','56','63','88','89','68','400'],
                            ['8','100','49','360','96','8','46','28','99','645','491','200','837']],
                           [['4','7','11','17','29','37','51','67','97','101','157','193'],
                            ['0','1','2','3','5','8','13','21','34','55','89','144','233','377','610','987']],
                           [['120','127','255','720','760','920','960','980','1280','1366','1440'],
                            ['2','4','8','16','32','64','128','256','512','1024','2048']],
                           [['1','57','87','117','141','153','167','173','187','201','203','207','209','219'],
                            ['2','3','5','7','11','13','17','19','23','29','31','37','41','43','47','53','59','61','67','71','73','79','83','89','97','101','103','107','109','113','127','131','137','139','149','151','157','163','167','173','179','181','191','193','197','199','211','223','227','229','233','239','241']],
                           [['19','47','71','89','131','157','179','193','211'],
                            ['1','3','5','7','9','11','13','15','17','21','23','25','27','29','31','33','35','37','39','41','43','45','49','51','53','55','57','59','61','63','65','67','69','73','75','77','79','81','83','85','87','91','93','95','97','99','101','103','105','107','109','111','113','115','117','119','121','123','125','127','129','133','135','137','139','141','143','145','147','149','151','153','155','159','161','163','165','167','169','171','173','175','177','181','183','185','187','189','191','195','197','199','201','203','207','209','213','215','217','219','221','223','225','227','229','231','233','235','237','239','241']],
                           [['36','82','90','100','126','134','148','160','172','196'],
                            ['1','3','5','7','9','11','13','15','17','19','21','23','25','27','29','31','33','35','37','39','41','43','45','47','49','51','53','55','57','59','61','63','65','67','69','71','73','75','77','79','81','83','85','87','89','91','93','95','97','99','101','103','105','107','109','111','113','115','117','119','121','123','125','127','129','131','133','135','137','139','141','143','145','147','149','151','153','155','157','159','161','163','165','167','169','171','173','175','177','179','181','183','185','187','189','191','193','195','197','199','201','203','207','209','211','213','215','217','219','221','223','225','227','229','231','233','235','237','239','241']],
                           [['A','E','F','H','I','K','T','X','Y'],
                            ['B','C','D','G','H','J','L','M','N','O','P','Q','R','S','U','V','W','Z']],
                           [['F','I','J','K','T','X','Y'],
                            ['A','B','C','D','E','G','H','L','M','N','O','P','Q','R','S','U','V','W','Z']],
                           [['a','e','f','h','i','k','t','x','y'],
                            ['b','c','d','g','h','j','l','m','n','o','p','q','r','s','u','v','w','z']],
                           [['f','i','j','k','t','x','y'],
                            ['a','b','c','d','e','g','h','l','m','n','o','p','q','r','s','u','v','w','z']]] };
}));
